const returnedOrderDescription = (status: number, type: 'SUMMERY' | 'FULL' = 'SUMMERY'): string =>
    (type === 'SUMMERY'
        ? [
              'درخواست مرجوعی شما ﺛﺒﺖ شد.',
              'درخواست مرجوعی شما در حال بررسی است.',
              'درخواست مرجوعی شما بررسی شده، از قسمت مشاهده مرجوعی میتوانید نتیجه را مشاهده کنید.',
          ]
        : [
              'در ﺧﻮاﺳﺖ ﻣﺮﺟﻮﻋﯽ ﺷﻤﺎ ﺛﺒﺖ شد، نتیجه را پس از بررسی از همین قسمت اطلاع رسانی می‌کنیم.',
              'درﺧﻮاﺳﺖ ﻣﺮﺟﻮﻋﯽ ﺷﻤﺎ دیده شد و در ﺣﺎل ﺑﺮرﺳﯽ اﺳﺖ. ﻧﺘﯿﺠﻪ را ﺑﻪ زودی ﺑﻪ ﺷﻤﺎ اﻃﻠﺎع ﻣﯽ دﻫﯿﻢ.',
              'درﺧﻮاﺳﺖ ﻣﺮﺟﻮﻋﯽ ﺷﻤﺎ ﺑﺎ دﻗﺖ ﺑﺮرﺳﯽ ﺷﺪه اﺳﺖ. نتیجه روی هر محصول بصورت مجزا مشخص شده است. ﺑﺮای اﻃﻠﺎﻋﺎت ﺑﯿﺸﺘﺮ ﻣﯽ ﺗﻮاﻧﯿﺪ ﺑﺎ ﻣﺎ ﺗﻤﺎس ﺑﯿﮕﺮﯾﺪ. ',
          ])[status - 1];

export default returnedOrderDescription;
